music_app/app/models/user.rb

  def reset_session_token!
    self.session_token = self.class.generate_session_token
    self.save!
---
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "PZF-WjzRN0O-G9AggzW--A"], ["id", 1]]