music_app/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "PZF-WjzRN0O-G9AggzW--A"], ["LIMIT", 1]]
---
  def current_user
    @current_user ||= User.find_by(session_token: session_token[:session_token])