music_app/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "hello@hi.com"], ["password_digest", "$2a$12$/P12TgqbjwEXPKkaU.wYz.4ut0MDo4GOdSlUlOHkZxyOsKjh84QIO"], ["session_token", "WI16AyfJXLybrRlyjd9JlQ"]]
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "PZF-WjzRN0O-G9AggzW--A"], ["id", 1]]
---
  def create
    @user = User.create(user_params)
    if @user.save